import 'package:flutter/material.dart';

class AboutUs extends StatelessWidget {
  const AboutUs({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('من نحن'),
      ),
      body: const Center(
        child: SingleChildScrollView(
          padding: EdgeInsets.all(20),
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.center,
            children: [
              Text(
                'من نحن',
                style: TextStyle(
                  fontWeight: FontWeight.bold,
                  fontSize: 18,
                ),
              ),
              SizedBox(height: 10),
              Text(
                '''تأسس البنك الزراعي العربي السعودي بموجب المرسوم الملكي رقم (58) وتاريخ 3/12/1382هـ ليكون مؤسسة ائتمانية حكومية متخصصة في تمويل مختلف مجالات النشاط الزراعي في جميع مناطق المملكة، للمساعدة في تنمية القطاع الزراعي ورفع كفاءته الإنتاجية باستخدام أفضل الأساليب العلمية والتقنية الحديثة، وذلك عن طريق تقديم قروض ميسرة بدون فوائد للمزارعين لتأمين ما يلزم هذا النشاط مثل المكائن والمضخات والآلات الزراعية ومعدات تربية الأبقار والدواجن والأغنام ومعدات تربية النحل والأسماك وغيرها.
              وفي 29 محرم 1430 هـ وافق مجلس الوزراء، بعد النظر في قرار مجلس الشورى رقم ( 106/71 ) وتاريخ 4/2/1429هـ على نظام صندوق التنمية الزراعية بالصيغة المرفقة بالقرار. ومن أبرز ملامح النظام : يحل هذا النظام محل ( نظام البنك الزراعي العربي السعودي )، ورأس مال الصندوق 20 مليار ريال وتجوز زيادة رأس المال بقرار من مجلس الوزراء، مع مراعاة المحافظة على المياه 
              وترشيد استخداماتها الزراعية والمحافظة على البيئة، ويهدف الصندوق إلى دعم التنمية الزراعية واستدامتها عن طريق تقديم القروض الميسرة والتسهيلات الائتمانية اللازمة.''',
                textAlign: TextAlign.center,
              ),
            ],
          ),
        ),
      ),
    );
  }
}
